// Задача 64: Задайте значения M и N. Напишите программу, которая выведет все чётные натуральные числа в промежутке от M до N с помощью рекурсии

// string PrintNumbers (int m, int n)
// {
//     if (m == n) return m.ToString ();
// return (m + " " + PrintNumbers(m+1,n));
// }
// Console.Write ("введите первое число: ");
// int M = int.Parse (Console.ReadLine());
// Console.Write ("введите второе число: ");
// int N = int.Parse (Console.ReadLine());
// Console.WriteLine (PrintNumbers (M, N));