// Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем

// Console.WriteLine("введите некие четыре значения");
// double k1 = Convert.ToInt32(Console.ReadLine());
// double b1 = Convert.ToInt32(Console.ReadLine());
// double k2 = Convert.ToInt32(Console.ReadLine());
// double b2 = Convert.ToInt32(Console.ReadLine());
// double PointXY(double k1, double b1, double k2, double b2)
// {

//     if (k1 == k2)
//     {
//         return 1;
//     }
//     else 
//     {
//          return 0;
//           }
// }
// if (PointXY(k1, b1, k2, b2)==1)
// {
//     Console.WriteLine("прямые параллельны");
// }
// else {  

//     double xA =((b2-b1)/(k1-k2));
//     double yA = k2*xA + b2;
// Console.WriteLine ( xA + ";" + yA);
// }